app/controllers/store_controller.rb

  def decrement_item
    product = Product.find(params[:id])
---
SELECT * FROM "products" WHERE ("products"."id" = 6)

  def save_order
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(@cart)
    if @order.save
---
INSERT INTO "line_items" ("product_id", "order_id", "quantity", "total_price", "created_at", "updated_at") VALUES(4, 11, 2, 59.9, '2010-07-31 10:55:56', '2010-07-31 10:55:56')
INSERT INTO "orders" ("name", "address", "email", "pay_type", "created_at", "updated_at") VALUES('Nick', 'blahblah', 'blah', 'cc', '2010-07-31 10:55:56', '2010-07-31 10:55:56')